src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Calltouch</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chat2Desk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CoMagic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenApi</Name>
					<Comment>WhatsApp</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Marquiz</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roistat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TapLink</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tilda</Name>
					<Comment>Ловец лидов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vkontakte</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VkontakteApi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Webhook</Name>
					<Comment>Получение лидов стандартный набор параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВиджетОнлайнЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЭМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтурСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложениеУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкиИОтзывы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроДокторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМетрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы/Forms/ФормаДобавленияВнешнейСистемы/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивРазделовОтбора") Тогда
		ЭтотОбъект.СписокРазделовОтбора.ЗагрузитьЗначения(Параметры.МассивРазделовОтбора);
	КонецЕсли;
	
	СформироватьДинамическиеЭлементыВнешнихСистем();
	Элементы.РазделДляКопирования.Видимость = Ложь;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ДобавитьВнешнююСистему(Команда)
	
	ИмяЭлемента = СтрЗаменить(ЭтотОбъект.ТекущийЭлемент.Имя, "_КнопкаНастройки", "");
	МассивСтрок = ТаблицаТиповВнешнихСистем.НайтиСтроки(Новый Структура("ИмяЭлементаФормы", ИмяЭлемента));
	Если МассивСтрок.Количество() > 0 Тогда
		ТипВнешнейСистемы	= МассивСтрок[0].ТипВнешнейСистемы; 
		ПараметрыОткрытия	= Новый Структура("ТипВнешнейСистемы", ТипВнешнейСистемы);
		ИмяФормыВС			= "Справочник.ВнешниеСистемы.ФормаОбъекта";
		
		ОткрытьФорму(ИмяФормыВС, ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, добавляет на форму динамические элементы внешних систем.
//
Процедура СформироватьДинамическиеЭлементыВнешнихСистем()
	
	МассивТиповВС = ПолучитьТипыВнешнихСистем();
	
	Для Каждого ТипВнешнейСистемы Из МассивТиповВС Цикл
		ДобавитьЭлементыВнешнейСистемы(ТипВнешнейСистемы, ПолучитьРазделВнешнейСистемы(ТипВнешнейСистемы));
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура, добавляет элементы формы.
//
Процедура ДобавитьЭлементыВнешнейСистемы(ТипВнешнейСистемы, Раздел)
	
	Если СписокРазделовОтбора.Количество() > 0 И СписокРазделовОтбора.НайтиПоЗначению(Раздел) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Найти(Раздел) = Неопределено Тогда
		СоздатьРазделВнешнихСистем(Раздел);
	КонецЕсли;
	
	СоздатьЭлементыВнешнейСистемы(ТипВнешнейСистемы, Раздел);
	
КонецПроцедуры

&НаСервере
// Процедура, создает динамическик элементы.
//
Процедура СоздатьЭлементыВнешнейСистемы(ТипВнешнейСистемы, Раздел)
	
	СтрокаРаздела		 = НайтиСоздатьСтрокуРаздела(Раздел);
	ГруппаВнешнейСистемы = СоздатьГруппуВнешнейСистемы(СтрокаРаздела);
	
	СоздатьДекорациюКартинка(ТипВнешнейСистемы, ГруппаВнешнейСистемы);
	СоздатьДекорациюОписание(ТипВнешнейСистемы, ГруппаВнешнейСистемы);
	ДобавитьКнопкуСоздания(ГруппаВнешнейСистемы);
	
	НоваяСтрока					  = ЭтотОбъект.ТаблицаТиповВнешнихСистем.Добавить();
	НоваяСтрока.ТипВнешнейСистемы = ТипВнешнейСистемы;
	НоваяСтрока.ИмяЭлементаФормы  = ГруппаВнешнейСистемы.Имя;
	
КонецПроцедуры

&НаСервере
// Процедура, создает группу раздела внешних систем.
//
Процедура СоздатьРазделВнешнихСистем(Раздел)
	
	НовыйРаздел		 = Элементы.Добавить(Раздел, Тип("ГруппаФормы"), Элементы.ГруппаРазделы);
	НовыйРаздел.Вид	 = ВидГруппыФормы.ОбычнаяГруппа;
	ЗаполнитьЗначенияСвойств(НовыйРаздел, Элементы.РазделДляКопирования,, "ПутьКДаннымЗаголовка, Заголовок, Видимость");
	
	НовыйРаздел.Заголовок = ПолучитьЗаголовокРаздела(Раздел);
	
КонецПроцедуры

&НаСервере
// Функция, возвращает группу формы для размещения элементов.
//
Функция НайтиСоздатьСтрокуРаздела(Раздел)
	
	ИндексСтроки = 0;
	Для Каждого СтрокаРаздела Из Элементы[Раздел].ПодчиненныеЭлементы Цикл
		Если СтрокаРаздела.ПодчиненныеЭлементы.Количество() < 5 Тогда // количество внешних систем в строке
			Возврат СтрокаРаздела;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат СоздатьСтрокуРаздела(Раздел, ИндексСтроки);
	
КонецФункции

&НаСервере
// Функция, возвращает группу формы для размещения элементов.
//
Функция СоздатьСтрокуРаздела(Раздел, ИндексСтроки)
	
	НоваяСтрока		 = Элементы.Добавить(Раздел + "_Строка_" + ИндексСтроки, Тип("ГруппаФормы"), Элементы[Раздел]);
	НоваяСтрока.Вид	 = ВидГруппыФормы.ОбычнаяГруппа;
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Элементы.РазделДляКопирования_Строка_0,, "ПутьКДаннымЗаголовка, Видимость");
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаСервере
// Функция, возвращает группу формы для размещения элементов.
//
Функция СоздатьГруппуВнешнейСистемы(СтрокаРаздела)
	
	ГруппаВнешнейСистемы	 = Элементы.Добавить(СтрокаРаздела.Имя + "_Элемент_" + СтрокаРаздела.ПодчиненныеЭлементы.Количество(), Тип("ГруппаФормы"), СтрокаРаздела);
	ГруппаВнешнейСистемы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЗаполнитьЗначенияСвойств(ГруппаВнешнейСистемы, Элементы.РазделДляКопирования_Строка_0_Элемент_0,, "ПутьКДаннымЗаголовка, Видимость");
	
	Возврат ГруппаВнешнейСистемы;
	
КонецФункции

&НаСервере
// Процедура, создает динамические элементы формы.
//
Процедура СоздатьДекорациюКартинка(ТипВнешнейСистемы, ГруппаРодитель)
	
	Декорация	  = Элементы.Добавить(ГруппаРодитель.Имя + "_ДекорацияКартинка", Тип("ДекорацияФормы"), ГруппаРодитель);
	Декорация.Вид = ВидДекорацииФормы.Картинка;
	ЗаполнитьЗначенияСвойств(Декорация, Элементы.РазделДляКопирования_Строка_0_Элемент_0_ДекорацияКартинка,, "Картинка, Видимость");

	Декорация.Картинка = ПолучитьКартинкуВнешнейСистемы(ТипВнешнейСистемы);
	
КонецПроцедуры

&НаСервере
// Процедура, создает динамические элементы формы.
//
Процедура СоздатьДекорациюОписание(ТипВнешнейСистемы, ГруппаРодитель)
	
	Декорация	  = Элементы.Добавить(ГруппаРодитель.Имя + "_ДекорацияНадпись", Тип("ДекорацияФормы"), ГруппаРодитель);
	Декорация.Вид = ВидДекорацииФормы.Надпись;
	ЗаполнитьЗначенияСвойств(Декорация, Элементы.РазделДляКопирования_Строка_0_Элемент_0_ДекорацияНадпись,, "Заголовок, Видимость");
	
	Декорация.Заголовок = ПолучитьОписаниеВнешнейСистемы(ТипВнешнейСистемы);
	
КонецПроцедуры

&НаСервере
// Процедура, создает динамические элементы формы.
//
Процедура ДобавитьКнопкуСоздания(ГруппаРодитель)
	
	ГруппаКнопки	 = Элементы.Добавить(ГруппаРодитель.Имя + "_ГруппаНастройки", Тип("ГруппаФормы"), ГруппаРодитель);
	ГруппаКнопки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЗаполнитьЗначенияСвойств(ГруппаКнопки, Элементы.РазделДляКопирования_Строка_0_Элемент_0_ГруппаСоздать,, "ПутьКДаннымЗаголовка, Видимость");
	
	Кнопка		 = Элементы.Добавить(ГруппаРодитель.Имя + "_КнопкаНастройки", Тип("КнопкаФормы"), ГруппаКнопки);
	Кнопка.Вид	 = ВидКнопкиФормы.ОбычнаяКнопка;
	ЗаполнитьЗначенияСвойств(Кнопка, Элементы.РазделДляКопирования_Строка_0_Элемент_0_КнопкаСоздать,, "Видимость");
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает все внешние системы.
//
Функция ПолучитьТипыВнешнихСистем()
	
	МассивИсключаемыхТипов = Новый Массив;
	
	// Пока не добавленные внешние системы.
	МассивИсключаемыхТипов.Добавить(Перечисления.ТипыВнешнихСистем.Chat2Desk);
	//МассивИсключаемыхТипов.Добавить(Перечисления.ТипыВнешнихСистем.IPТелефония);
	//МассивИсключаемыхТипов.Добавить(Перечисления.ТипыВнешнихСистем.CoMagic);
	//МассивИсключаемыхТипов.Добавить(Перечисления.ТипыВнешнихСистем.JivoSite);
	//МассивИсключаемыхТипов.Добавить(Перечисления.ТипыВнешнихСистем.Marquiz);
	//МассивИсключаемыхТипов.Добавить(Перечисления.ТипыВнешнихСистем.TapLink);
	//МассивИсключаемыхТипов.Добавить(Перечисления.ТипыВнешнихСистем.Tilda);
	МассивИсключаемыхТипов.Добавить(Перечисления.ТипыВнешнихСистем.ЯндексКарты);
	МассивИсключаемыхТипов.Добавить(Перечисления.ТипыВнешнихСистем.КонтурСтрахование);
	МассивИсключаемыхТипов.Добавить(Перечисления.ТипыВнешнихСистем.Vkontakte);
	МассивИсключаемыхТипов.Добавить(Перечисления.ТипыВнешнихСистем.МобильноеПриложениеУправляющего);
	МассивИсключаемыхТипов.Добавить(Перечисления.ТипыВнешнихСистем.ОценкиИОтзывы);
	
	Если НЕ ОбщегоНазначенияСтоматология.ИспользуетсяРасширение("Мессенджер") Тогда 
		
		ТипыВнешнихСистемМессенджера = Справочники.ВнешниеСистемы.ПолучитьМассивТиповВнешнихСистемМессенджера();
		
		Для Каждого ТипВнешнейСистемы Из ТипыВнешнихСистемМессенджера Цикл
			МассивИсключаемыхТипов.Добавить(ТипВнешнейСистемы);
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТипыВнешнихСистем.Ссылка КАК ТипВнешнейСистемы
	|ИЗ
	|	Перечисление.ТипыВнешнихСистем КАК ТипыВнешнихСистем
	|ГДЕ
	|	НЕ ТипыВнешнихСистем.Ссылка В (&МассивИсключаемыхТипов)");
	
	Запрос.УстановитьПараметр("МассивИсключаемыхТипов", МассивИсключаемыхТипов);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТипВнешнейСистемы");
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает заголовок для группы раздела.
//
Функция ПолучитьЗаголовокРаздела(Раздел)
	
	Если Раздел = "МобильныеПриложения" Тогда
		Возврат НСтр("ru = 'Мобильные приложения'; en = 'Mobile applications'");
	ИначеЕсли Раздел = "ИсточникиЛидов" Тогда
		Возврат НСтр("ru = 'Источники лидов'; en = 'Sources of leads'");
	ИначеЕсли Раздел = "СквознаяАналитика" Тогда
		Возврат НСтр("ru = 'Сквозная аналитика'; en = 'End-to-end analytics'");
	ИначеЕсли Раздел = "ЭлектронныеКарты" Тогда
		Возврат НСтр("ru = 'Электронные карты'; en = 'Electronic cards'");
	ИначеЕсли Раздел = "ОнлайнЗапись" Тогда
		Возврат НСтр("ru = 'Онлайн-запись'; en = 'Online recording'");
	ИначеЕсли Раздел = "Мессенджеры" Тогда
		Возврат НСтр("ru = 'Мессенджеры'; en = 'Messengers'");
	ИначеЕсли Раздел = "Телефония" Тогда
		Возврат НСтр("ru = 'Телефония'; en = 'Telephony'");
	ИначеЕсли Раздел = "Прочее" Тогда
		Возврат НСтр("ru = 'Прочее'; en = 'Other'");
	Иначе
		Возврат Раздел;
	КонецЕсли;	
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает картинку внешней системы.
//
Функция ПолучитьКартинкуВнешнейСистемы(ТипВнешнейСистемы)
	
	Возврат Справочники.ВнешниеСистемы.ПолучитьКартинкуВнешнейСистемы(ТипВнешнейСистемы);
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает имя раздела внешней системы.
//
Функция ПолучитьРазделВнешнейСистемы(ТипВнешнейСистемы)
	
	Возврат Справочники.ВнешниеСистемы.ПолучитьРазделВнешнейСистемы(ТипВнешнейСистемы);
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает описание внешней системы.
//
Функция ПолучитьОписаниеВнешнейСистемы(ТипВнешнейСистемы)
	
	Возврат Строка(ТипВнешнейСистемы);
	
КонецФункции

#КонецОбласти
